program(1.0) {
    func main<ios15>(tensor<fp32, [1, 720, 1280, 12]> input_1) {
            tensor<int32, [4]> transpose_1_perm_0 = const()[name = tensor<string, []>("transpose_1_perm_0"), val = tensor<int32, [4]>([0, 3, 1, 2])];
            tensor<string, []> input_1_to_fp16_dtype_0 = const()[name = tensor<string, []>("input_1_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<string, []> reconstruction_module4x_sequential_conv2d_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_conv2d_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_conv2d_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_conv2d_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_conv2d_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 12, 3, 3]> transpose_0_to_fp16 = const()[name = tensor<string, []>("transpose_0_to_fp16"), val = tensor<fp16, [32, 12, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> const_11_to_fp16 = const()[name = tensor<string, []>("const_11_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7040)))];
            tensor<fp16, [1, 720, 1280, 12]> cast_26 = cast(dtype = input_1_to_fp16_dtype_0, x = input_1);
            tensor<fp16, [1, 12, 720, 1280]> transpose_23 = transpose(perm = transpose_1_perm_0, x = cast_26);
            tensor<fp16, [1, 32, 720, 1280]> reconstruction_module4x_sequential_conv2d_BiasAdd_cast = conv(bias = const_11_to_fp16, dilations = reconstruction_module4x_sequential_conv2d_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_conv2d_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_conv2d_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_conv2d_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_conv2d_Conv2Dx_strides_0, weight = transpose_0_to_fp16, x = transpose_23);
            tensor<fp16, [1, 32, 720, 1280]> reconstruction_module4x_sequential_conv2d_Relu_cast = relu(x = reconstruction_module4x_sequential_conv2d_BiasAdd_cast);
            tensor<string, []> reconstruction_module4x_sequential_conv2d_1_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_1_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_conv2d_1_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_1_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_conv2d_1_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_1_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_conv2d_1_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_1_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_conv2d_1_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_conv2d_1_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 32, 3, 3]> transpose_2_to_fp16 = const()[name = tensor<string, []>("transpose_2_to_fp16"), val = tensor<fp16, [16, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(7168)))];
            tensor<fp16, [16]> const_12_to_fp16 = const()[name = tensor<string, []>("const_12_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16448)))];
            tensor<fp16, [1, 16, 720, 1280]> reconstruction_module4x_sequential_conv2d_1_BiasAdd_cast = conv(bias = const_12_to_fp16, dilations = reconstruction_module4x_sequential_conv2d_1_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_conv2d_1_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_conv2d_1_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_conv2d_1_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_conv2d_1_Conv2Dx_strides_0, weight = transpose_2_to_fp16, x = reconstruction_module4x_sequential_conv2d_Relu_cast);
            tensor<fp16, [1, 16, 720, 1280]> reconstruction_module4x_sequential_conv2d_1_Relu_cast = relu(x = reconstruction_module4x_sequential_conv2d_1_BiasAdd_cast);
            tensor<int32, [2]> max_pool_0_kernel_sizes_0 = const()[name = tensor<string, []>("max_pool_0_kernel_sizes_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> max_pool_0_strides_0 = const()[name = tensor<string, []>("max_pool_0_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> max_pool_0_pad_type_0 = const()[name = tensor<string, []>("max_pool_0_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [4]> max_pool_0_pad_0 = const()[name = tensor<string, []>("max_pool_0_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> max_pool_0_ceil_mode_0 = const()[name = tensor<string, []>("max_pool_0_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 16, 360, 640]> max_pool_0_cast = max_pool(ceil_mode = max_pool_0_ceil_mode_0, kernel_sizes = max_pool_0_kernel_sizes_0, pad = max_pool_0_pad_0, pad_type = max_pool_0_pad_type_0, strides = max_pool_0_strides_0, x = reconstruction_module4x_sequential_conv2d_1_Relu_cast);
            tensor<string, []> reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 16, 3, 3]> transpose_5_to_fp16 = const()[name = tensor<string, []>("transpose_5_to_fp16"), val = tensor<fp16, [32, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(16576)))];
            tensor<fp16, [32]> const_13_to_fp16 = const()[name = tensor<string, []>("const_13_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25856)))];
            tensor<fp16, [1, 32, 360, 640]> reconstruction_module4x_sequential_1_conv2d_2_BiasAdd_cast = conv(bias = const_13_to_fp16, dilations = reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_1_conv2d_2_Conv2Dx_strides_0, weight = transpose_5_to_fp16, x = max_pool_0_cast);
            tensor<fp16, [1, 32, 360, 640]> reconstruction_module4x_sequential_1_conv2d_2_Relu_cast = relu(x = reconstruction_module4x_sequential_1_conv2d_2_BiasAdd_cast);
            tensor<string, []> reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 32, 3, 3]> transpose_7_to_fp16 = const()[name = tensor<string, []>("transpose_7_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(25984)))];
            tensor<fp16, [32]> const_14_to_fp16 = const()[name = tensor<string, []>("const_14_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44480)))];
            tensor<fp16, [1, 32, 360, 640]> reconstruction_module4x_sequential_1_conv2d_3_BiasAdd_cast = conv(bias = const_14_to_fp16, dilations = reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_1_conv2d_3_Conv2Dx_strides_0, weight = transpose_7_to_fp16, x = reconstruction_module4x_sequential_1_conv2d_2_Relu_cast);
            tensor<fp16, [1, 32, 360, 640]> reconstruction_module4x_sequential_1_conv2d_3_Relu_cast = relu(x = reconstruction_module4x_sequential_1_conv2d_3_BiasAdd_cast);
            tensor<int32, [2]> max_pool_1_kernel_sizes_0 = const()[name = tensor<string, []>("max_pool_1_kernel_sizes_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> max_pool_1_strides_0 = const()[name = tensor<string, []>("max_pool_1_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<string, []> max_pool_1_pad_type_0 = const()[name = tensor<string, []>("max_pool_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [4]> max_pool_1_pad_0 = const()[name = tensor<string, []>("max_pool_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<bool, []> max_pool_1_ceil_mode_0 = const()[name = tensor<string, []>("max_pool_1_ceil_mode_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 32, 180, 320]> max_pool_1_cast = max_pool(ceil_mode = max_pool_1_ceil_mode_0, kernel_sizes = max_pool_1_kernel_sizes_0, pad = max_pool_1_pad_0, pad_type = max_pool_1_pad_type_0, strides = max_pool_1_strides_0, x = reconstruction_module4x_sequential_1_conv2d_3_Relu_cast);
            tensor<string, []> reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [64, 32, 3, 3]> transpose_10_to_fp16 = const()[name = tensor<string, []>("transpose_10_to_fp16"), val = tensor<fp16, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(44608)))];
            tensor<fp16, [64]> const_15_to_fp16 = const()[name = tensor<string, []>("const_15_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81536)))];
            tensor<fp16, [1, 64, 180, 320]> reconstruction_module4x_sequential_2_conv2d_4_BiasAdd_cast = conv(bias = const_15_to_fp16, dilations = reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_2_conv2d_4_Conv2Dx_strides_0, weight = transpose_10_to_fp16, x = max_pool_1_cast);
            tensor<fp16, [1, 64, 180, 320]> reconstruction_module4x_sequential_2_conv2d_4_Relu_cast = relu(x = reconstruction_module4x_sequential_2_conv2d_4_BiasAdd_cast);
            tensor<string, []> reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [4]> reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_output_shape_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_output_shape_0"), val = tensor<int32, [4]>([1, 64, 360, 640])];
            tensor<int32, [2]> reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, []> reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 2, 2]> transpose_12_to_fp16 = const()[name = tensor<string, []>("transpose_12_to_fp16"), val = tensor<fp16, [64, 64, 2, 2]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(81728)))];
            tensor<fp16, [64]> const_16_to_fp16 = const()[name = tensor<string, []>("const_16_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(114560)))];
            tensor<fp16, [1, 64, 360, 640]> reconstruction_module4x_sequential_2_conv2d_transpose_BiasAdd_cast = conv_transpose(bias = const_16_to_fp16, dilations = reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_dilations_0, groups = reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_groups_0, output_shape = reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_output_shape_0, pad = reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_pad_0, pad_type = reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_pad_type_0, strides = reconstruction_module4x_sequential_2_conv2d_transpose_conv2d_transposex_strides_0, weight = transpose_12_to_fp16, x = reconstruction_module4x_sequential_2_conv2d_4_Relu_cast);
            tensor<fp16, [1, 64, 360, 640]> reconstruction_module4x_sequential_2_conv2d_transpose_Relu_cast = relu(x = reconstruction_module4x_sequential_2_conv2d_transpose_BiasAdd_cast);
            tensor<bool, []> reconstruction_module4x_concat_interleave_0 = const()[name = tensor<string, []>("reconstruction_module4x_concat_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> const_5 = const()[name = tensor<string, []>("const_5"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 96, 360, 640]> reconstruction_module4x_concat_cast = concat(axis = const_5, interleave = reconstruction_module4x_concat_interleave_0, values = (reconstruction_module4x_sequential_1_conv2d_3_Relu_cast, reconstruction_module4x_sequential_2_conv2d_transpose_Relu_cast));
            tensor<string, []> reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [32, 96, 3, 3]> transpose_14_to_fp16 = const()[name = tensor<string, []>("transpose_14_to_fp16"), val = tensor<fp16, [32, 96, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(114752)))];
            tensor<fp16, [32]> const_17_to_fp16 = const()[name = tensor<string, []>("const_17_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170112)))];
            tensor<fp16, [1, 32, 360, 640]> reconstruction_module4x_sequential_3_conv2d_5_BiasAdd_cast = conv(bias = const_17_to_fp16, dilations = reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_3_conv2d_5_Conv2Dx_strides_0, weight = transpose_14_to_fp16, x = reconstruction_module4x_concat_cast);
            tensor<fp16, [1, 32, 360, 640]> reconstruction_module4x_sequential_3_conv2d_5_Relu_cast = relu(x = reconstruction_module4x_sequential_3_conv2d_5_BiasAdd_cast);
            tensor<string, []> reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [4]> reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_output_shape_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_output_shape_0"), val = tensor<int32, [4]>([1, 32, 720, 1280])];
            tensor<int32, [2]> reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, []> reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 2, 2]> transpose_16_to_fp16 = const()[name = tensor<string, []>("transpose_16_to_fp16"), val = tensor<fp16, [32, 32, 2, 2]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(170240)))];
            tensor<fp16, [32]> const_18_to_fp16 = const()[name = tensor<string, []>("const_18_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178496)))];
            tensor<fp16, [1, 32, 720, 1280]> reconstruction_module4x_sequential_3_conv2d_transpose_1_BiasAdd_cast = conv_transpose(bias = const_18_to_fp16, dilations = reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_dilations_0, groups = reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_groups_0, output_shape = reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_output_shape_0, pad = reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_pad_0, pad_type = reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_pad_type_0, strides = reconstruction_module4x_sequential_3_conv2d_transpose_1_conv2d_transposex_strides_0, weight = transpose_16_to_fp16, x = reconstruction_module4x_sequential_3_conv2d_5_Relu_cast);
            tensor<fp16, [1, 32, 720, 1280]> reconstruction_module4x_sequential_3_conv2d_transpose_1_Relu_cast = relu(x = reconstruction_module4x_sequential_3_conv2d_transpose_1_BiasAdd_cast);
            tensor<bool, []> reconstruction_module4x_concat_1_interleave_0 = const()[name = tensor<string, []>("reconstruction_module4x_concat_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<int32, []> const_2 = const()[name = tensor<string, []>("const_2"), val = tensor<int32, []>(1)];
            tensor<fp16, [1, 48, 720, 1280]> reconstruction_module4x_concat_1_cast = concat(axis = const_2, interleave = reconstruction_module4x_concat_1_interleave_0, values = (reconstruction_module4x_sequential_conv2d_1_Relu_cast, reconstruction_module4x_sequential_3_conv2d_transpose_1_Relu_cast));
            tensor<string, []> reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [16, 48, 3, 3]> transpose_18_to_fp16 = const()[name = tensor<string, []>("transpose_18_to_fp16"), val = tensor<fp16, [16, 48, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(178624)))];
            tensor<fp16, [16]> const_19_to_fp16 = const()[name = tensor<string, []>("const_19_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192512)))];
            tensor<fp16, [1, 16, 720, 1280]> reconstruction_module4x_sequential_4_conv2d_6_BiasAdd_cast = conv(bias = const_19_to_fp16, dilations = reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_4_conv2d_6_Conv2Dx_strides_0, weight = transpose_18_to_fp16, x = reconstruction_module4x_concat_1_cast);
            tensor<fp16, [1, 16, 720, 1280]> reconstruction_module4x_sequential_4_conv2d_6_Relu_cast = relu(x = reconstruction_module4x_sequential_4_conv2d_6_BiasAdd_cast);
            tensor<string, []> reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_pad_type_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_pad_type_0"), val = tensor<string, []>("same")];
            tensor<int32, [2]> reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_strides_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_dilations_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_groups_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_groups_0"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_pad_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<fp16, [3, 16, 3, 3]> conv_0_weight_0_to_fp16 = const()[name = tensor<string, []>("conv_0_weight_0_to_fp16"), val = tensor<fp16, [3, 16, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(192640)))];
            tensor<fp16, [3]> conv_0_bias_0_to_fp16 = const()[name = tensor<string, []>("conv_0_bias_0_to_fp16"), val = tensor<fp16, [3]>([0x1.d64p-9, 0x1.06p-6, 0x1.3ep-6])];
            tensor<fp16, [1, 3, 720, 1280]> conv_0_cast = conv(bias = conv_0_bias_0_to_fp16, dilations = reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_dilations_0, groups = reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_groups_0, pad = reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_pad_0, pad_type = reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_pad_type_0, strides = reconstruction_module4x_sequential_4_conv2d_7_Conv2Dx_strides_0, weight = conv_0_weight_0_to_fp16, x = reconstruction_module4x_sequential_4_conv2d_6_Relu_cast);
            tensor<int32, [4]> reconstruction_module4x_sequential_4_conv2d_7_Conv2D_perm_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_7_Conv2D_perm_0"), val = tensor<int32, [4]>([0, 2, 3, 1])];
            tensor<fp16, [1, 720, 1280, 3]> transpose_22 = transpose(perm = reconstruction_module4x_sequential_4_conv2d_7_Conv2D_perm_0, x = conv_0_cast);
            tensor<fp16, [1, 720, 1280, 3]> reconstruction_module4x_sequential_4_conv2d_7_Relu_cast = relu(x = transpose_22);
            tensor<string, []> reconstruction_module4x_sequential_4_conv2d_7_Relu_cast_to_fp32_dtype_0 = const()[name = tensor<string, []>("reconstruction_module4x_sequential_4_conv2d_7_Relu_cast_to_fp32_dtype_0"), val = tensor<string, []>("fp32")];
            tensor<fp32, [1, 720, 1280, 3]> Identity = cast(dtype = reconstruction_module4x_sequential_4_conv2d_7_Relu_cast_to_fp32_dtype_0, x = reconstruction_module4x_sequential_4_conv2d_7_Relu_cast);
        } -> (Identity);
}